app/controllers/blog_indices_controller.rb

  def create
    #@blog_index = BlogIndex.new(blog_index_params)
    #formのblog_indices(中身はタイトル)を配列で取得
    @blog_title=params[:blog_indices]
    #formのblog_textesを配列で取得
    @texts_array=params[:blog_textes]
    #formのblog_imagesを配列で取得
    @images_array=params[:blog_images]
    #@images_array2=params[:blog_images][:img_2].read
    #texts_arrayのkeyの最大値取得
    @texts_array_max = @texts_array.keys.map {|item| item.to_i }.max
    #images_arrayのkeyの最大値取得
    @images_array_max = @images_array.keys.map {|item| item.to_i }.max
    #images_array_maxと@texts_array_maxの最大値を取得
    @array_max_sum = @texts_array_max + @images_array_max
    #logger.debug(@blog_title)
    #logger.debug(@texts_array)
    #logger.debug(@images_array)
    #logger.debug(@images_array2)
    #logger.debug(@texts_array_max)
    #logger.debug(@images_array_max)
    #logger.debug(@texts_array_max + @images_array_max)
    #logger.debug(@texts_array["1"])
    #logger.debug(@blog_title["title"])

    #トランザクション開始
    begin
      BlogIndex.transaction do
        #blog_indicesをコミット
        #title contents_id（image)の最大値 details_id(title)最大値をコミット
        @blog_index = BlogIndex.create(:title => @blog_title["title"],:contents_id => @images_array_max,:detail_id => @array_max_sum)
---
INSERT INTO `blog_images` (`contents_id`, `created_at`, `detail_id`, `image`, `updated_at`) VALUES (1, '2015-02-14 05:50:49', 2, x'323031352f312f322e6a7067', '2015-02-14 05:50:49')
INSERT INTO `blog_indices` (`contents_id`, `created_at`, `detail_id`, `title`, `updated_at`) VALUES (2, '2015-02-14 05:50:49', 5, ' ブログを開設しました', '2015-02-14 05:50:49')

        #contents_idにblog_indexのidを投入
        #detail_idは_formに記載されている番号
        for @text in @texts_array do
          @blog_text = BlogTextes.create(:contents_id=>@blog_index.id,:detail_id=>@text[0] ,:text=>@text[1])
---
INSERT INTO `blog_textes` (`contents_id`, `created_at`, `detail_id`, `text`, `updated_at`) VALUES (1, '2015-02-14 05:50:49', 1, 'プログラミングを勉強したい。 \r\n\r\nRailsを使って、ブログサイトを作ろう。\r\n\r\nそう思い立ち、作ってみました。', '2015-02-14 05:50:49')